openfoam-case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(
    (0 0 0)                  // 0  axis0
    (0 50 -2.183047)         // 1  neg0
    (0 50 2.183047)          // 2  pos0
    (80 0 0)                 // 3  axis1
    (80 50 -2.183047)        // 4  neg1
    (80 50 2.183047)         // 5  pos1
    (200 0 0)                // 6  axis2
    (200 25 -1.091524)       // 7  neg2
    (200 25 1.091524)        // 8  pos2
    (240 0 0)                // 9  axis3
    (240 25 -1.091524)       // 10 neg3
    (240 25 1.091524)        // 11 pos3
    (440 0 0)                // 12 axis4
    (440 50 -2.183047)       // 13 neg4
    (440 50 2.183047)        // 14 pos4
    (520 0 0)                // 15 axis5
    (520 50 -2.183047)       // 16 neg5
    (520 50 2.183047)        // 17 pos5
);

blocks
(
    hex (0 3 4 1  0 3 5 2)     (16 20 1) simpleGrading (1 1 1)
    hex (3 6 7 4  3 6 8 5)     (24 20 1) simpleGrading (1 1 1)
    hex (6 9 10 7  6 9 11 8)   (8 20 1)  simpleGrading (1 1 1)
    hex (9 12 13 10  9 12 14 11) (40 20 1) simpleGrading (1 1 1)
    hex (12 15 16 13  12 15 17 14) (16 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 0 2 1));
    }
    outlet
    {
        type patch;
        faces ((15 15 16 17));
    }
    wall
    {
        type wall;
        faces
        (
            (1 4 5 2)
            (4 7 8 5)
            (7 10 11 8)
            (10 13 14 11)
            (13 16 17 14)
        );
    }
    frontWedge
    {
        type wedge;
        faces
        (
            (0 3 5 2)
            (3 6 8 5)
            (6 9 11 8)
            (9 12 14 11)
            (12 15 17 14)
        );
    }
    backWedge
    {
        type wedge;
        faces
        (
            (0 1 4 3)
            (3 4 7 6)
            (6 7 10 9)
            (9 10 13 12)
            (12 13 16 15)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
            (3 6 6 3)
            (6 9 9 6)
            (9 12 12 9)
            (12 15 15 12)
        );
    }
);
